articles/20220114075952-don_t_chase_the_side_product.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Don't chase the side product</title>
<meta name="generator" content="Org mode" />

<link rel="stylesheet" href="https://unpkg.com/sakura.css/css/sakura.css" type="text/css">
</head>
<body>
<div id="content">
<h1 class="title">Don't chase the side product</h1>
<p>
Recently I came cross a great quote by H. David Thoreau:
</p>

<blockquote>
<p>
"Success usually comes to those who are too busy to be looking for it".
</p>
</blockquote>

<p>
I think it's great in that I believe its underlying logic or rationale. In my perspective, success is only a side product. A lot of things people are pursuing, wealth, fame, or even happiness, are just side products. They are the side products that would be more likely to come when we pursue things that truly matter to us, or to others &#x2013; the main product. You can't get the side products by chasing only the side products themselves, because the definition of the word "side product" won't allow that to happen, otherwise they are not side products at all. So, many people's pursuits actually don't make any sense to me. What they are chasing is just like flowers in a mirror or the moon's reflection in water.
</p>

<p>
So what should be the main product? You may ask. Well, I believe this is a question that everyone should ask themselves.
</p>
</div>
</body>
</html>
